app/controllers/blogcasts_controller.rb

SELECT * FROM "blogcasts" WHERE (user_id = 2 AND year = 2010 AND month = 11 AND day = 3 AND link_title = 'vegas_trip_2010') LIMIT 1
---
  def create
    #MVR - authentication
    if params[:authentication_token].nil?
      @user = current_user
    else
      @user = rest_current_user
    end
    #MVR - needed for browser refreshing
    if request.format.html? && params[:blogcast].nil?
      redirect_to new_blogcast_path
      return
    end
    #AS DESIGNED: rest api passes parameters in the same way as web
    @blogcast = Blogcast.new(params[:blogcast])
    @blogcast.user_id = @user.id
    #MVR - if starting_at is not set, set it to current time
    if @blogcast.starting_at.nil?
      @blogcast.starting_at = Time.now
    end
    #MVR - if link_title is not set, set it to lowercase title with non-alphanumeric characters replaced with an underscore
    if @blogcast.link_title.blank?

INSERT INTO "tags" ("name", "updated_at", "user_id", "created_at") VALUES('Vegas', '2010-11-04 01:30:27', 2, '2010-11-04 01:30:27')
SELECT "tags".* FROM "tags" INNER JOIN "blogcast_tags" ON "tags".id = "blogcast_tags".tag_id WHERE (("blogcast_tags".blogcast_id = 26))
INSERT INTO "blogcast_tags" ("updated_at", "blogcast_id", "tag_id", "created_at") VALUES('2010-11-04 01:30:28', 26, 13, '2010-11-04 01:30:28')
INSERT INTO "blogcasts" ("month", "short_url", "updated_at", "title", "is_featured", "description", "day", "year", "starting_at", "user_id", "link_title", "views_count", "created_at") VALUES(11, NULL, '2010-11-04 01:30:28', 'Vegas Trip 2010', NULL, 'Just testing out some changes I''ve made to the profile page while up in the air on my way to Vegas! Will be happy when we land.', 3, 2010, '2010-11-04 01:29:00', 2, 'vegas_trip_2010', 0, '2010-11-04 01:30:28')
---
      for tag in tags
        #MVR - add tag if not present
        #AS DESIGNED: no error checking just proceed
        user_tag = @user.tags.find_or_create_by_name(tag)
        blogcast_tag = BlogcastTag.new
        blogcast_tag.tag_id = user_tag.id
        @blogcast.blogcast_tags.push(blogcast_tag)

DELETE FROM "blogcasts" WHERE "id" = 26
---
      thrift_client_close
    rescue
      @blogcast.errors.add_to_base "Unable to create blogcast muc room"
      @blogcast.destroy