app/controllers/home_controller.rb

SELECT * FROM "blogcasts" WHERE ("blogcasts".user_id = 2 AND (starting_at < '2010-11-04 01:29:23' AND starting_at > '2010-10-04 01:29:23')) LIMIT 3
SELECT count(*) AS count_all FROM "blogcasts" WHERE (user_id = 2 AND starting_at < '2010-11-04 01:29:23' AND starting_at > '2010-10-04 01:29:23')
---
  def index
    @user = current_user
    #MVR - upcoming blogcasts
    @upcoming_blogcasts = @user.blogcasts.find(:all, :conditions => ["starting_at > ?", Time.zone.now], :limit => 3)
    @num_upcoming_blogcasts = Blogcast.count(:conditions => ["user_id = ? AND starting_at > ?", @user.id, Time.zone.now])