app/controllers/settings_controller.rb

  def edit
    @user = current_user
    #MVR - find setting object or create it
    @setting = Setting.find_or_create_by_user_id(@user.id)
    @username_possesive = @user.username + (@user.username =~ /.*s$/ ? "'":"'s")
    @themes = Theme.all
---
SELECT * FROM "settings" WHERE ("settings"."user_id" = 2) LIMIT 1
SELECT * FROM "themes"