app/controllers/subscriptions_controller.rb

  def create
    @profile_user = User.find(params[:user_id])
    if @profile_user.nil?
      @error = "Unable to subscribe to #{@profile_user.username}. User does not exist."
      render :action => "error"
      return
    end
    user = current_user
    #MVR - make sure user is signed in
    if user.nil?
      @error = "Unable to subscribe to #{@profile_user.username}. You are not signed in."
      render :action => "error"
      return
    end
    if user.id == @profile_user.id
      @error = "Unable to subscribe to #{@profile_user.username}. You can not subscribe to yourself."
      render :action => "error"
      return
    end
    #MVR - do not allow the same subscription multiple times
    @subscription = Subscription.find(:first, :conditions => {:user_id => user.id, :subscribed_to => @profile_user.id})
    if !@subscription.nil?
      @error = "Unable to subscribe to #{@profile_user.username}. You are already subscribed."
      render :action => "error"
      return
    end
    #MVR - add to database
    @subscription = Subscription.new
    @subscription.user_id = user.id
    @subscription.subscribed_to = @profile_user
    @subscription.save
---
SELECT * FROM "users" WHERE ("users"."id" = 5)
SELECT * FROM "subscriptions" WHERE ("subscriptions"."subscribed_to" = 5 AND "subscriptions"."user_id" = 2) LIMIT 1
INSERT INTO "subscriptions" ("updated_at", "subscribed_to", "user_id", "created_at") VALUES('2010-11-03 21:19:40', 5, 2, '2010-11-03 21:19:40')

  def destroy
    user = current_user
    #MVR - make sure user is signed in
    if user.nil?
      @error = "Unable to unsubscribe. You are not signed in."
      render :action => "error"
      return
    end
    begin
      @subscription = user.subscriptions.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      @error = "Unable to unsubscribe. Invalid subscription id."
      render :action => "error"
      return
    end
    @profile_user = @subscription.subscribed_to
    @subscription.destroy
---
SELECT * FROM "subscriptions" WHERE ("subscriptions"."id" = 2 AND ("subscriptions".user_id = 2))
DELETE FROM "subscriptions" WHERE "id" = 2