app/controllers/users/blogcasts_controller.rb

SELECT * FROM "users" WHERE ("users"."username" = 'mrushton') AND ( ("users"."type" = 'BlogcastrUser' ) ) LIMIT 1
SELECT count(*) AS count_all FROM "blogcasts" WHERE (user_id = 2 AND id <= 24)
SELECT count(*) AS count_all FROM "comments" WHERE ("comments".user_id = 2)
SELECT count(*) AS count_all FROM "likes" WHERE ("likes"."user_id" = 2)
SELECT max("blogcasts".id) AS max_id FROM "blogcasts" WHERE (user_id = 2)
---
  def tagged
    #MVR - find user by username
    if params[:username].nil?
      respond_to do |format|
        format.html {render :file => "public/404.html", :layout => false, :status => 404}
        format.xml {render :xml => "<errors><error>Couldn't find BlogcastrUser with NAME=\"#{params[:username]}\"</error></errors>", :status => :unprocessable_entity}
        format.json {render :json => "[[\"Couldn't find BlogcastrUser with NAME=\"#{params[:username]}\"\"]]", :status => :unprocessable_entity}
      end
      return
    end
    @profile_user = BlogcastrUser.find_by_username(params[:username])
    if @profile_user.nil?
      respond_to do |format|
        format.html {render :file => "public/404.html", :layout => false, :status => 404}
        format.xml {render :xml => "<errors><error>Couldn't find BlogcastrUser with NAME=\"#{params[:username]}\"</error></errors>", :status => :unprocessable_entity}
        format.json {render :json => "[[\"Couldn't find BlogcastrUser with NAME=\"#{params[:username]}\"\"]]", :status => :unprocessable_entity}
      end
      return
    end
    respond_to do |format|
      format.html {
        @user = current_user
        #MVR - blogcasts
        @num_blogcasts = @profile_user.blogcasts.count
        #MVR - comments
        @num_comments = @profile_user.comments.count
        #MVR - likes
        @num_likes = Like.count(:conditions => {:user_id => @profile_user.id})

SELECT count(*) AS count_all FROM "posts" WHERE ("posts".user_id = 2)
---
          @num_last_blogcast = @num_paginated_blogcasts
        end
        #MVR - posts
        @num_posts = @profile_user.posts.count

SELECT * FROM "user_notifications" WHERE (user_id = 2 AND notifying_about = 2) AND ( ("user_notifications"."type" = 'EmailUserNotification' ) ) LIMIT 1
---
        @profile_user_full_name_possesive = @profile_user.username + (@profile_user.username =~ /.*s$/ ? "'":"'s")
        @profile_user_username_possesive_escaped = @profile_user_username_possesive.gsub(/'/,"\\\\\'")
        if @user.instance_of?(BlogcastrUser)
          @email_user_notification = EmailUserNotification.find(:first, :conditions => ["user_id = ? AND notifying_about = ?", @user.id, @profile_user.id])