app/controllers/users/profile_controller.rb

  def index
    @user = current_user
    @profile_user = User.find_by_username(params[:username])
    if @profile_user.nil?
      #MVR - treat this as a 404 error
      render :file => "#{RAILS_ROOT}/public/404.html", :layout => false, :status => 404
      return
    end
    if !@user.nil? && @user.id != @profile_user.id
      @subscription = @user.subscriptions.find(:first, :conditions => {:subscribed_to => @profile_user.id})
    end
    #MVR - upcoming blogcasts
    @upcoming_blogcasts = @profile_user.blogcasts.find(:all, :conditions => ["starting_at > ?", Time.zone.now], :order => "starting_at", :limit => 2)
    #MVR - past blogcasts
    @past_blogcasts = @profile_user.blogcasts.find(:all, :conditions => ["starting_at < ?", Time.zone.now], :order => "starting_at DESC", :limit => 2)
    #MVR - blogcasts
    @num_blogcasts = @profile_user.blogcasts.count
    #MVR - comments
    @num_comments = @profile_user.comments.count
    #MVR - likes
    @num_likes = Like.count(:conditions => {:user_id => @profile_user.id})
---
SELECT * FROM "users" WHERE ("users"."username" = 'mrushton') LIMIT 1
SELECT * FROM "subscriptions" WHERE ("subscriptions".user_id = 2 AND ("subscriptions"."subscribed_to" = 5)) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 2)
SELECT * FROM "blogcasts" WHERE ("blogcasts".user_id = 2 AND (starting_at < '2010-11-03 19:56:33' AND starting_at > '2010-10-03 19:56:33')) ORDER BY starting_at LIMIT 3
SELECT count(*) AS count_all FROM "blogcasts" WHERE (user_id = 2 AND starting_at < '2010-11-03 19:56:33' AND starting_at > '2010-10-03 19:56:33')
SELECT count(*) AS count_all FROM "subscriptions" WHERE ("subscriptions".subscribed_to = 2)
SELECT count(*) AS count_all FROM "comments" WHERE ("comments".blogcast_id = 4)
SELECT count(*) AS count_all FROM "likes" WHERE ("likes".blogcast_id = 4)

    @profile_username_possesive = @profile_user.username + (@profile_user.username =~ /.*s$/ ? "'":"'s")
    @profile_username_possesive_escaped = @profile_username_possesive.gsub(/'/,"\\\\\'")
    if @user.instance_of?(BlogcastrUser)
      @email_user_notification = EmailUserNotification.find(:first, :conditions => ["user_id = ? AND notifying_about = ?", @user.id, @profile_user.id])
---
SELECT * FROM "user_notifications" WHERE (user_id = 2 AND notifying_about = 2) AND ( ("user_notifications"."type" = 'EmailUserNotification' ) ) LIMIT 1